Public Member Functions | Public Attributes | List of all members
API_HotlinkNode Struct Reference
Hotlink Manager
Describes a hotlink node. More...
#include <APIdefs_Database.h>
 Public Member Functions
~API_HotlinkNode ()
 Public Attributes
API_Guid  | guid
Globally unique Id of the node.
API_HotlinkTypeID  | type
Hotlink source reference type (Hotlinked Module or XRef)
API_HotlinkStoryRangeID  | storyRangeType
Single or multistory hotlink.
GSTime  | updateTime
Time of the hotlink was updated last.
IO::Location *  | sourceLocation
Location of the source file.
GS::uchar_t  | name [API_UniLongNameLen]
Name of the hotlink node.
GS::uchar_t  | refFloorName [API_UniLongNameLen]
Name of the hotlinked story.
short  | refFloorInd
Index of the hotlinked story in case of single-story hotlinked module.
GSType  | ownerId
Owner identifier of the hotlink node (0 means the Hotlink Manager of Archicad)
API_HotlinkUserData  | userData
Optional custom data handled by the owner.
IO::Location *  | serverSourceLocation
Location of the source file on the server.
API_HotlinkSourceTypeID  | sourceType
Source reference type, could be APIHotlink_LocalFile, APIHotlink_TWFS (TeamWork File System), or APIHotlink_TWProject (TeamWork project)
UInt64  | fileSize
Size of the source file.
Int64  | versionNumber
File revision number (only for revisions), Teamwork file system only.
Detailed Description
Describes a hotlink node.
Since
Archicad 26
Remarks
The destructor of this structure will automatically deallocate the memory pointed by the sourceLocation, serverSourceLocation and userData fields. Make sure those point to memory on heap.
Constructor & Destructor Documentation
◆ ~API_HotlinkNode()
 API_HotlinkNode::~API_HotlinkNode  |  ( |   | )
inline
Destroys the hotlink node and cleans up properly.
Member Data Documentation
◆ fileSize
 API_HotlinkNode::fileSize
Size of the source file.
◆ guid
 API_HotlinkNode::guid
Globally unique Id of the node.
◆ name
 API_HotlinkNode::name
Name of the hotlink node.
◆ ownerId
 API_HotlinkNode::ownerId
Owner identifier of the hotlink node (0 means the Hotlink Manager of Archicad)
◆ refFloorInd
 API_HotlinkNode::refFloorInd
Index of the hotlinked story in case of single-story hotlinked module.
◆ refFloorName
 API_HotlinkNode::refFloorName
Name of the hotlinked story.
◆ serverSourceLocation
 API_HotlinkNode::serverSourceLocation
Location of the source file on the server.
◆ sourceLocation
 API_HotlinkNode::sourceLocation
Location of the source file.
◆ sourceType
 API_HotlinkNode::sourceType
Source reference type, could be APIHotlink_LocalFile, APIHotlink_TWFS (TeamWork File System), or APIHotlink_TWProject (TeamWork project)
◆ storyRangeType
 API_HotlinkNode::storyRangeType
Single or multistory hotlink.
◆ type
 API_HotlinkNode::type
Hotlink source reference type (Hotlinked Module or XRef)
◆ updateTime
 API_HotlinkNode::updateTime
Time of the hotlink was updated last.
◆ userData
 API_HotlinkNode::userData
Optional custom data handled by the owner.
◆ versionNumber
 API_HotlinkNode::versionNumber
File revision number (only for revisions), Teamwork file system only.